tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

brew 'awscli'
brew 'bash-language-server'
brew 'bat'
brew 'bottom'
brew 'docker-credential-helper'
brew 'exa'
brew 'fd'
brew 'fzf'
brew 'git-delta'
brew 'go'
brew 'gopls'
brew 'helm'
brew 'jq'
brew 'kubectl'
brew 'lua-language-server'
brew 'mas'
brew 'neovim'
brew 'node'
brew 'pre-commit'
brew 'pyright'
brew 'python'
brew 'ripgrep'
brew 'starship'
brew 'terraform-docs'
brew 'terraform-ls'
brew 'terragrunt'
brew 'tfk8s'
brew 'tfsec'
brew 'tmux'
brew 'tmux-mem-cpu-load'
brew 'trash'
brew 'yaml-language-server'
brew 'yq'
brew 'zoxide'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask 'alacritty', args: { 'no-quarantine': true }
cask 'docker'
cask 'font-hack-nerd-font'
cask 'rectangle'
cask 'slack'

mas 'AdGuard for Safari', id: 1440147259
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Vimari', id: 1480933944

