# vim: set ft=ruby

tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'romkatv/powerlevel10k'

brew 'awscli'
brew 'bash-language-server'
brew 'delve'
brew 'docker-compose'
brew 'go'
brew 'gomodifytags'
brew 'gopls'
brew 'gotests'
brew 'htop'
brew 'jq'
brew 'k9s'
brew 'lua-language-server'
brew 'mas'
brew 'neovim'
brew 'node'
brew 'powerlevel10k'
brew 'pre-commit'
brew 'pyright'
brew 'python'
brew 'ripgrep'
brew 'terraform-docs'
brew 'terraform-ls'
brew 'terraformer'
brew 'terragrunt'
brew 'tfk8s'
brew 'tfsec'
brew 'trash'
brew 'tree'
brew 'yaml-language-server'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

cask 'font-hack-nerd-font'
cask 'goland'
cask 'kitty'
cask 'logitech-options'
cask 'openemu', args: { 'no-quarantine': true } if ENV['USER'] == 'hermitmaster'
cask 'rancher'
cask 'rectangle'
cask 'slack'
cask 'zsa-wally'

mas 'AdGuard for Safari', id: 1440147259
mas 'Vimari', id: 1480933944
