# frozen_string_literal: true

tap 'fluxcd/tap'
tap 'homebrew/cask'

brew 'awscli'
brew 'aws-iam-authenticator'
brew 'aws-sso-cli'
brew 'azure-cli'
brew 'bat'
brew 'bottom'
brew 'cdktf'
brew 'cdk8s'
brew 'cmctl'
brew 'cobra-cli'
brew 'coreutils'
brew 'crane'
brew 'csvkit'
brew 'd2'
brew 'dasel'
brew 'direnv'
brew 'dive'
brew 'docker'
brew 'eza'
brew 'fd'
brew 'fluxcd/tap/flux'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'git-remote-codecommit'
brew 'go'
brew 'gradle'
brew 'grex'
brew 'groovy'
brew 'grpcurl'
brew 'helm'
brew 'jq'
brew 'k9s'
brew 'kubectx'
brew 'kubent'
brew 'kubernetes-cli'
brew 'kustomize'
brew 'lazydocker'
brew 'lazygit'
brew 'mas'
brew 'maven'
brew 'neovim'
brew 'nmap'
brew 'node'
brew 'opa'
brew 'openjdk'
brew 'podman'
brew 'podman-compose'
brew 'powerlevel10k'
brew 'pre-commit'
brew 'prometheus'
brew 'python'
brew 'ripgrep'
brew 'ruby'
brew 'sd'
brew 'terraform'
brew 'terraform-docs'
brew 'terraformer'
brew 'typescript'
brew 'wget'
brew 'yarn'
brew 'yq'
brew 'zoxide'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask 'font-hack-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'goland'
cask 'keymapp'
cask 'podman-desktop'
cask 'rectangle'
cask 'visual-studio-code'
cask 'wezterm'
cask 'yubico-authenticator'
cask 'yubico-yubikey-manager'

mas 'AdGuard for Safari', id: 1_440_147_259
mas 'Vimari', id: 1_480_933_944

if ENV['USER'] == 'hermitmaster'
  cask 'openemu', args: { 'no-quarantine': true }
  cask 'steam'
else
  tap 'del/cloud15', 'ssh://git@hq-stash.corp.proofpoint.com:7999/del/homebrew-cloud15.git'
  tap 'del/cloud15-internal', 'ssh://git@hq-stash.corp.proofpoint.com:7999/del/homebrew-cloud15-internal.git'

  brew 'del/cloud15/c15-onelogin-client'
  brew 'del/cloud15-internal/namespace-creator'
end
