# frozen_string_literal: true

tap 'homebrew/services'
tap 'fluxcd/tap'
tap 'omissis/go-jsonschema'

brew 'aws-iam-authenticator'
brew 'aws-sso-cli'
brew 'awscli'
brew 'azure-cli'
brew 'bat'
brew 'bottom'
brew 'cdk8s'
brew 'cmctl'
brew 'cobra-cli'
brew 'codex'
brew 'coreutils'
brew 'csvkit'
brew 'd2'
brew 'dasel'
brew 'diff-so-fancy'
brew 'direnv'
brew 'dust'
brew 'eza'
brew 'fd'
brew 'findutils'
brew 'fluxcd/tap/flux'
brew 'fzf'
brew 'gci'
brew 'gh'
brew 'git'
brew 'git-remote-codecommit'
brew 'gnupg'
brew 'go'
brew 'golangci-lint'
brew 'gomodifytags'
brew 'gotests'
brew 'httpie'
brew 'jq'
brew 'k9s'
brew 'kubeconform'
brew 'kubectx'
brew 'kubent'
brew 'kustomize'
brew 'lazygit'
brew 'mas'
brew 'maven'
brew 'mtr'
brew 'ncdu'
brew 'neovim'
brew 'nmap'
brew 'node'
brew 'ollama'
brew 'opa'
brew 'openssl'
brew 'pinentry-mac'
brew 'podman'
brew 'podman-compose'
brew 'procs'
brew 'pure'
brew 'python'
brew 'ripgrep'
brew 'ruby'
brew 'shfmt'
brew 'shellcheck'
brew 'terraform'
brew 'terraform-docs'
brew 'typescript'
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'yq'
brew 'zoxide'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

cask 'chatgpt'
cask 'font-jetbrains-mono-nerd-font'
cask 'keymapp'
cask 'rancher'
cask 'rectangle'
cask 'visual-studio-code'
cask 'wezterm'

mas 'AdGuard for Safari', id: 1_440_147_259
mas 'Vimari', id: 1_480_933_944

if ENV['USER'] == 'hermitmaster'
  cask 'openemu', args: { 'no-quarantine': true }
  cask 'steam'
else
  tap 'del/cloud15', 'ssh://git@hq-stash.corp.proofpoint.com:7999/del/homebrew-cloud15.git'
  tap 'del/cloud15-internal', 'ssh://git@hq-stash.corp.proofpoint.com:7999/del/homebrew-cloud15-internal.git'

  brew 'del/cloud15-internal/namespace-creator'
  brew 'del/cloud15/c15-onelogin-client'

  cask 'yubico-authenticator'
  cask 'yubico-yubikey-manager'
end
