tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'romkatv/powerlevel10k'

brew 'ansible'
brew 'awscli'
brew 'bat'
brew 'bottom'
brew 'checkov'
brew 'coreutils'
brew 'delve'
brew 'diff-so-fancy'
brew 'direnv'
brew 'dive'
brew 'dog'
brew 'duf'
brew 'dust'
brew 'exa'
brew 'fd'
brew 'findutils'
brew 'fzf'
brew 'gcc'
brew 'git'
brew 'git-delta'
brew 'gnu-sed'
brew 'gnupg'
brew 'go'
brew 'gomodifytags'
brew 'gotests'
brew 'gradle'
brew 'grex'
brew 'groovy'
brew 'hyperfine'
brew 'jq'
brew 'k9s'
brew 'kops', args: ['ignore-dependencies']
brew 'kubectx', args: ['ignore-dependencies']
brew 'lua'
brew 'luarocks'
brew 'make'
brew 'mas'
brew 'maven'
brew 'most'
brew 'mtr'
brew 'neovim'
brew 'node'
brew 'openjdk'
brew 'powerlevel10k'
brew 'pre-commit'
brew 'prettier'
brew 'procs'
brew 'python'
brew 'ripgrep'
brew 'rust'
brew 'sd'
brew 'shellcheck'
brew 'shfmt'
brew 'starship'
brew 'staticcheck'
brew 'tealdeer'
brew 'terraform'
brew 'terraform-docs'
brew 'terraformer'
brew 'terragrunt'
brew 'tfk8s'
brew 'tflint'
brew 'tfsec'
brew 'tmux'
brew 'tmux-mem-cpu-load'
brew 'tokei'
brew 'trash'
brew 'virtualenv'
brew 'wget'
brew 'xh'
brew 'yq'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask 'alacritty', args: { 'no-quarantine': true }
cask 'font-hack-nerd-font'
cask 'mouse-fix', args: { 'no-quarantine': true }
cask 'openemu', args: { 'no-quarantine': true } if ENV['USER'] == 'hermitmaster'
cask 'rancher'
cask 'rectangle'

mas 'AdGuard for Safari', id: 1440147259
mas 'Vimari', id: 1480933944

