# frozen_string_literal: true

tap 'fluxcd/tap'
tap 'homebrew/cask'
tap 'kitagry/tap'

brew 'awscli'
brew 'aws-iam-authenticator'
brew 'aws-sso-cli'
brew 'bash-language-server'
brew 'bat'
brew 'bottom'
brew 'cffi'
brew 'cmctl'
brew 'checkmake'
brew 'coreutils'
brew 'csvkit'
brew 'd2'
brew 'diff-so-fancy'
brew 'direnv'
brew 'dockerfile-language-server'
brew 'exa'
brew 'fd'
brew 'fluxcd/tap/flux'
brew 'fzf'
brew 'git'
brew 'git-remote-codecommit'
brew 'go'
brew 'gofumpt'
brew 'gomodifytags'
brew 'gopls'
brew 'gotests'
brew 'grex'
brew 'grpcurl'
brew 'has'
brew 'helm'
brew 'helm-ls'
brew 'jq'
brew 'k9s'
brew 'kitagry/tap/regols'
brew 'kubectx'
brew 'kubent'
brew 'kubernetes-cli'
brew 'kustomize'
brew 'locust'
brew 'lua-language-server'
brew 'mas'
brew 'neovim'
brew 'node@18'
brew 'opa'
brew 'pluto'
brew 'powerlevel10k'
brew 'prettier'
brew 'prometheus'
brew 'python'
brew 'python-setuptools'
brew 'ripgrep'
brew 'ruby'
brew 'shellcheck'
brew 'shfmt'
brew 'six'
brew 'sql-language-server'
brew 'staticcheck'
brew 'tailwindcss-language-server'
brew 'terraform'
brew 'terraform-docs'
brew 'terraform-ls'
brew 'terraformer'
brew 'terragrunt'
brew 'tflint'
brew 'tfsec'
brew 'typescript'
brew 'typescript-language-server'
brew 'up'
brew 'vscode-langservers-extracted'
brew 'wget'
brew 'yaml-language-server'
brew 'yarn'
brew 'yq'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask 'docker'
cask 'font-jetbrains-mono-nerd-font'
cask 'goland'
cask 'mac-mouse-fix', args: { 'no-quarantine': true }
cask 'rectangle'
cask 'visual-studio-code'
cask 'wezterm'

mas 'AdGuard for Safari', id: 1_440_147_259
mas 'Vimari', id: 1_480_933_944

if ENV['USER'] == 'hermitmaster'
  cask 'openemu', args: { 'no-quarantine': true }
  cask 'steam'
else
  tap 'del/cloud15', 'ssh://git@hq-stash.corp.proofpoint.com:7999/del/homebrew-cloud15.git'
  tap 'del/cloud15-internal', 'ssh://git@hq-stash.corp.proofpoint.com:7999/del/homebrew-cloud15-internal.git'

  brew 'del/cloud15/c15-onelogin-client'
  brew 'del/cloud15-internal/namespace-creator'

  mas 'OneLogin for Safari', id: 1_475_824_389
end
