tap 'hermitmaster/tap'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'romkatv/powerlevel10k'

brew 'awscli'
brew 'bash-language-server'
brew 'bottom'
brew 'checkmake'
brew 'delve'
brew 'diff-so-fancy'
brew 'direnv'
brew 'dive'
brew 'dockerfile-language-server-nodejs'
brew 'exa'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'go'
brew 'gofumpt'
brew 'gomodifytags'
brew 'gopls'
brew 'gotests'
brew 'graphviz'
brew 'hadolint'
brew 'helm'
brew 'jq'
brew 'k9s'
brew 'kubectx'
brew 'kubent'
brew 'kubernetes-cli'
brew 'kustomize'
brew 'lua-language-server'
brew 'marksman'
brew 'mas'
brew 'neovim'
brew 'node'
brew 'opa'
brew 'powerlevel10k'
brew 'prettier'
brew 'pre-commit'
brew 'pyright'
brew 'python'
brew 'ripgrep'
brew 'shellcheck'
brew 'shfmt'
brew 'staticcheck'
brew 'stylua'
brew 'taplo'
brew 'terraform'
brew 'terraform-docs'
brew 'terraform-ls'
brew 'terraformer'
brew 'terragrunt'
brew 'tflint'
brew 'tfsec'
brew 'tmux'
brew 'tmux-mem-cpu-load'
brew 'trash'
brew 'typescript'
brew 'vim-language-server'
brew 'vscode-langservers-extracted'
brew 'wget'
brew 'yaml-language-server'
brew 'yq'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask 'alacritty', args: { 'no-quarantine': true }
cask 'docker'
cask 'font-hack-nerd-font'
cask 'goland'
cask 'mouse-fix', args: { 'no-quarantine': true }
cask 'rectangle'
cask 'wezterm'

mas 'AdGuard for Safari', id: 1440147259
mas 'Vimari', id: 1480933944

if ENV['USER'] == 'hermitmaster'
  cask 'openemu', args: { 'no-quarantine': true }
  cask 'steam'
else
  tap 'fluxcd/tap'
  tap 'synfinatic/aws-sso-cli'

  brew 'aws-iam-authenticator'
  brew 'fluxcd/tap/flux'
  brew 'git-remote-codecommit'
  brew 'prometheus'

  mas 'OneLogin for Safari', id: 1475824389
  mas 'Xcode', id: 497799835

  brew 'aws-sso-cli'
end
