# frozen_string_literal: true

tap 'fluxcd/tap'
tap 'hashicorp/tap'
tap 'homebrew/services'
tap 'terraform-linters/tap'

brew 'argocd'
brew 'awscli'
brew 'aws-sso-cli'
brew 'bash-language-server'
brew 'bat'
brew 'bottom'
brew 'busted'
brew 'cmctl'
brew 'conftest'
brew 'coreutils'
brew 'curl'
brew 'd2'
brew 'delve'
brew 'direnv'
brew 'docker-compose-langserver'
brew 'dockerfile-language-server'
brew 'eksctl'
brew 'eza'
brew 'fd'
brew 'findutils'
brew 'fluxcd/tap/flux'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'gitleaks'
brew 'gnu-sed'
brew 'go'
brew 'gofumpt'
brew 'goimports'
brew 'golangci-lint'
brew 'gomodifytags'
brew 'gopls'
brew 'gotests'
brew 'grpcurl'
brew 'hadolint'
brew 'hashicorp/tap/terraform'
brew 'helm-ls'
brew 'hyperfine'
brew 'infracost'
brew 'jq'
brew 'k3d'
brew 'k9s'
brew 'kind'
brew 'kube-linter'
brew 'kubebuilder'
brew 'kubeconform'
brew 'kubectx'
brew 'kubeseal'
brew 'kustomize'
brew 'lazygit'
brew 'lua-language-server'
brew 'luajit'
brew 'markdown-toc'
brew 'markdownlint-cli2'
brew 'marksman'
brew 'marp-cli'
brew 'mas'
brew 'neovim'
brew 'nmap'
brew 'node'
brew 'ollama'
brew 'opa'
brew 'prettier'
brew 'pre-commit'
brew 'pure'
brew 'pyright'
brew 'pytest'
brew 'python'
brew 'ripgrep'
brew 'ruff'
brew 'shellcheck'
brew 'shfmt'
brew 'skaffold'
brew 'sops'
brew 'stern'
brew 'stylua'
brew 'taplo'
brew 'terraform-docs'
brew 'terraform-ls'
brew 'terragrunt'
brew 'tf-summarize'
brew 'terraform-linters/tap/tflint'
brew 'tfsec'
brew 'tmux'
brew 'tree-sitter-cli'
brew 'typescript'
brew 'uv'
brew 'vscode-langservers-extracted'
brew 'watch'
brew 'wget'
brew 'yaml-language-server'
brew 'yamllint'
brew 'yarn'
brew 'yq'
brew 'zoxide'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

cask 'claude-code@latest'
cask 'keymapp'
cask 'obsidian'
cask 'rancher'
cask 'rectangle'
cask 'wezterm'

mas 'AdGuard for Safari', id: 1_440_147_259
mas 'Keynote',             id: 409_183_694
mas 'Numbers',             id: 409_203_825
mas 'OneLogin for Safari', id: 1_475_824_389
mas 'Pages',               id: 409_201_541
mas 'Xcode',               id: 497_799_835

if ENV['USER'] == 'hermitmaster'
  brew 'opencode'

  cask 'openemu', args: { 'no-quarantine': true }
else
  tap 'Azure/kubelogin'

  brew 'azure-cli'
  brew 'Azure/kubelogin/kubelogin'
  brew 'copier'
  brew 'snyk-cli'

  cask 'yubico-authenticator'
end
