# frozen_string_literal: true

tap 'fluxcd/tap'
tap 'hashicorp/tap'
tap 'homebrew/services'
tap 'thecasualcoder/stable'

brew 'awscli'
brew 'aws-iam-authenticator'
brew 'aws-sso-cli'
brew 'azure-cli'
brew 'bat'
brew 'bottom'
brew 'cdk8s'
brew 'cmake'
brew 'cmctl'
brew 'cobra-cli'
brew 'conftest'
brew 'coreutils'
brew 'csvkit'
brew 'curl'
brew 'd2'
brew 'dasel'
brew 'delta'
brew 'direnv'
brew 'dive'
brew 'doggo'
brew 'dyff'
brew 'eza'
brew 'fd'
brew 'findutils'
brew 'flux'
brew 'fzf'
brew 'gci'
brew 'gh'
brew 'git'
brew 'gitui'
brew 'git-delta'
brew 'git-remote-codecommit'
brew 'gnu-sed'
brew 'go'
brew 'golangci-lint'
brew 'gomodifytags'
brew 'gotests'
brew 'grpcurl'
brew 'hashicorp/tap/terraform'
brew 'httpie'
brew 'jq'
brew 'k9s'
brew 'kustomize'
brew 'kubeconform'
brew 'kubectx'
brew 'kubelogin'
brew 'kubent'
brew 'mas'
brew 'neovim'
brew 'nmap'
brew 'node'
brew 'ollama'
brew 'opa'
brew 'p7zip'
brew 'pandoc'
brew 'powerlevel10k'
brew 'pre-commit'
brew 'python'
brew 'ripgrep'
brew 'ruby'
brew 'rust'
brew 'rust-analyzer'
brew 'shellcheck'
brew 'starship'
brew 'stern'
brew 'terraform-docs'
brew 'terragrunt'
brew 'tflint'
brew 'tf-summarize'
brew 'tree'
brew 'tree-sitter-cli'
brew 'typescript'
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'yq'
brew 'zoxide'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

cask 'chatgpt'
cask 'keymapp'
cask 'rancher'
cask 'rectangle'
cask 'wezterm'
cask 'windsurf'
cask 'yubico-authenticator'
cask 'yubico-yubikey-manager'

mas 'AdGuard for Safari', id: 1_440_147_259

if ENV['USER'] == 'hermitmaster'
  cask 'openemu', args: { 'no-quarantine': true }
  cask 'steam'
else
  tap 'del/cloud15', "ssh://git@hq-stash.corp.proofpoint.com:7999/del/homebrew-cloud15.git"
  tap 'del/cloud15-internal', "ssh://git@hq-stash.corp.proofpoint.com:7999/del/homebrew-cloud15-internal.git"

  brew 'del/cloud15/c15-onelogin-client'
  brew 'del/cloud15/quartermaster@2'
  brew 'del/cloud15-internal/namespace-creator'

end
