# frozen_string_literal: true

tap 'fluxcd/tap'
tap 'hashicorp/tap'
tap 'homebrew/services'
tap 'Azure/kubelogin'

brew 'awscli'
brew 'aws-sso-cli'
brew 'azure-cli'
brew 'bat'
brew 'bottom'
brew 'busted'
brew 'cdk8s'
brew 'cmctl'
brew 'conftest'
brew 'copier'
brew 'coreutils'
brew 'csvkit'
brew 'curl'
brew 'd2'
brew 'direnv'
brew 'duf'
brew 'dust'
brew 'eza'
brew 'fd'
brew 'findutils'
brew 'fzf'
brew 'gemini-cli'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'gitleaks'
brew 'gnu-sed'
brew 'go'
brew 'golangci-lint'
brew 'gomodifytags'
brew 'gotests'
brew 'grpcurl'
brew 'hashicorp/tap/terraform'
brew 'hyperfine'
brew 'infracost'
brew 'jq'
brew 'k9s'
brew 'kube-linter'
brew 'kubebuilder'
brew 'kubeconform'
brew 'kubectx'
brew 'Azure/kubelogin/kubelogin'
brew 'kubeseal'
brew 'kustomize'
brew 'lazygit'
brew 'luajit'
brew 'marp-cli'
brew 'mas'
brew 'mitmproxy'
brew 'neovim'
brew 'nmap'
brew 'node'
brew 'ollama'
brew 'opa'
brew 'prettier'
brew 'pre-commit'
brew 'procs'
brew 'pure'
brew 'pytest'
brew 'python'
brew 'ripgrep'
brew 'session-manager-plugin'
brew 'stern'
brew 'terraform-docs'
brew 'terragrunt'
brew 'tf-summarize'
brew 'tfsec'
brew 'tldr'
brew 'tree-sitter-cli'
brew 'trivy'
brew 'typescript'
brew 'uv'
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'yq'
brew 'zoxide'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

cask 'chatgpt'
cask 'claude-code@latest'
cask 'font-jetbrains-mono-nerd-font'
cask 'keymapp'
cask 'rancher'
cask 'rectangle'
cask 'visual-studio-code'
cask 'wezterm'

mas 'AdGuard for Safari', id: 1_440_147_259

if ENV['USER'] == 'hermitmaster'
  cask 'openemu', args: { 'no-quarantine': true }
else
  tap 'del/cloud15', "ssh://git@hq-stash.corp.proofpoint.com:7999/del/homebrew-cloud15.git"
  brew 'del/cloud15/c15-onelogin-client'

  cask 'windsurf'
  cask 'yubico-authenticator'
end
